Revit 2027 API
CompoundStructure.MinimumSampleHeight Property
 The minimum sample height determined by the current sample height and the horizontal segments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MinimumSampleHeight { get; }
Public ReadOnly Property MinimumSampleHeight As Double
	Get
public:
property double MinimumSampleHeight {
	double get ();
}
member MinimumSampleHeight : float with get
Property Value
Double
Remarks
 All horizontal segments dimensioned to the top must remain strictly above all horizontal segments dimensioned to the bottom.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace